<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body>



<h1 id="TN">T&Ecirc;N</h1>

<p>debconf-updatepo &mdash; c&#x1EAD;p nh&#x1EAD;t c&aacute;c t&#x1EAD;p tin PO v&#x1EC1; m&#x1EAB;u c&#x1EA5;u h&igrave;nh debconf</p>

<h1 id="TM-TT">T&Oacute;M T&#x1EAE;T</h1>

<p><b>debconf-updatepo</b> [<b>-v</b>] [<b>-h</b>] [<b>--podir=<i>TH&#x1AF;_M&#x1EE4;C</i></b>] [<b>--skip-pot</b>] [<b>--skip-merge</b>] [<b>--msgid-bugs-address=<i>&#x110;&#x1ECA;A_CH&#x1EC8;</i></b>]</p>

<h1 id="M-T">M&Ocirc; T&#x1EA2;</h1>

<p>Ch&#x1B0;&#x1A1;ng tr&igrave;nh n&agrave;y &#x111;&#x1ECD;c <i>po/POTFILES.in</i> &#x111;&#x1EC3; quy&#x1EBF;t &#x111;&#x1ECB;nh nh&#x1EEF;ng t&#x1EAD;p tin ch&#x1EE7; n&agrave;o c&#x1EA7;n x&#x1EED; l&yacute;, sau &#x111;&oacute; tr&iacute;ch c&aacute;c chu&#x1ED7;i gettext m&#x1EDB;i v&agrave;o t&#x1EAD;p tin <i>po/templates.pot</i> v&agrave; c&#x1EAD;p nh&#x1EAD;t t&#x1EA5;t c&#x1EA3; c&aacute;c t&#x1EAD;p tin <i>po/*.po</i>. V&#x103;n l&#x1EC7;nh n&agrave;y c&oacute; th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c g&#x1ECD;i ho&#x1EB7;c trong th&#x1B0; m&#x1EE5;c c&#x1EA5;p &#x111;&#x1EA7;u, ho&#x1EB7;c trong th&#x1B0; m&#x1EE5;c con <i>debian</i> hay <i>debian/po</i>. N&oacute; &#x111;&#x1B0;&#x1EE3;c ch&#x1EA1;y b&#x1EDF;i nh&agrave; ph&aacute;t tri&#x1EC3;n v&agrave;/hay ng&#x1B0;&#x1EDD;i d&#x1ECB;ch &#x111;&#x1EC3; c&#x1EAD;p nh&#x1EAD;t c&aacute;c t&#x1EAD;p tin PO khi chu&#x1ED7;i g&#x1ED1;c (th&#x1B0;&#x1EDD;ng l&agrave; ti&#x1EBF;ng Anh) b&#x1ECB; s&#x1EED;a &#x111;&#x1ED5;i trong t&#x1EAD;p tin <i>templates</i>.</p>

<h1 id="TY-CHN">T&Ugrave;Y CH&#x1ECC;N</h1>

<dl>

<dt id="h---help"><b>-h</b>, <b>--help</b></dt>
<dd>

<p>Hi&#x1EC3;n th&#x1ECB; b&#x1EA3;n t&oacute;m t&#x1EAF;t c&aacute;ch s&#x1EED; d&#x1EE5;ng, r&#x1ED3;i tho&aacute;t.</p>

</dd>
<dt id="v---verbose"><b>-v</b>, <b>--verbose</b></dt>
<dd>

<p>X&#x1EED; l&yacute; &#x1EDF; ch&#x1EBF; &#x111;&#x1ED9; chi ti&#x1EBF;t (xu&#x1EA5;t nhi&#x1EC1;u d&#x1EEF; li&#x1EC7;u di&#x1EC5;n t&#x1EA3; ti&#x1EBF;n tr&igrave;nh, h&#x1EEF;u &iacute;ch &#x111;&#x1EC3; g&#x1EE1; l&#x1ED7;i).</p>

</dd>
<dt id="podir-TH_MC"><b>--podir=<i>TH&#x1AF;_M&#x1EE4;C</i></b></dt>
<dd>

<p>&#x110;&#x1EB7;t th&#x1B0; m&#x1EE5;c ch&#x1EE9;a c&aacute;c t&#x1EAD;p tin PO. M&#x1EB7;c &#x111;&#x1ECB;nh l&agrave; t&igrave;m ki&#x1EBF;m c&aacute;c t&#x1EAD;p tin PO trong th&#x1B0; m&#x1EE5;c <i>debian/po</i>, <i>po</i> v&agrave; <i>../po</i> theo th&#x1EE9; t&#x1EF1; &#x111;&oacute;.</p>

</dd>
<dt id="skip-pot"><b>--skip-pot</b></dt>
<dd>

<p>&#x110;&#x1EEB;ng t&#x1EA1;o ra t&#x1EAD;p tin <i>po/templates.pot</i> m&#x1EDB;i.</p>

</dd>
<dt id="skip-merge"><b>--skip-merge</b></dt>
<dd>

<p>&#x110;&#x1EEB;ng tr&#x1ED9;n c&aacute;c t&#x1EAD;p tin PO &#x111;&atilde; t&#x1ED3;n t&#x1EA1;i v&#x1EDB;i <i>po/templates.pot</i>.</p>

</dd>
<dt id="msgid-bugs-address-A_CH"><b>--msgid-bugs-address=<i>&#x110;&#x1ECA;A_CH&#x1EC8;</i></b></dt>
<dd>

<p>&#x110;&#x1EB7;t &#x111;&#x1ECB;a ch&#x1EC9; th&#x1B0; &#x111;i&#x1EC7;n t&#x1EED; s&#x1EBD; &#x111;&#x1B0;&#x1EE3;c hi&#x1EC3;n th&#x1ECB; trong tr&#x1B0;&#x1EDD;ng Report-Msgid-Bugs-To c&#x1EE7;a t&#x1EAD;p tin POT. Khuy&ecirc;n b&#x1EA1;n &#x111;&#x1EB7;t gi&aacute; tr&#x1ECB; n&agrave;y: n&oacute; gi&uacute;p ng&#x1B0;&#x1EDD;i d&#x1ECB;ch th&ocirc;ng b&aacute;o l&#x1ED7;i v&agrave; h&#x1ECF;i c&acirc;u v&#x1EC1; chu&#x1ED7;i g&#x1ED1;c, v&igrave; v&#x1EAD;y t&#x1EA1;o c&#x1EA3; chu&#x1ED7;i g&#x1ED1;c l&#x1EAB;n chu&#x1ED7;i d&#x1ECB;ch &#x111;&#x1EC1;u t&#x1ED1;t h&#x1A1;n.</p>

<p>M&#x1EB7;c &#x111;&#x1ECB;nh l&agrave; tr&#x1B0;&#x1EDD;ng n&agrave;y c&oacute; gi&aacute; tr&#x1ECB; &lt;t&ecirc;n_g&oacute;i&gt;@package.debian.org.</p>

<p>N&oacute; d&#x1EF1; &#x111;&#x1ECB;nh cho nh&agrave; duy tr&igrave; b&#x1EA3;n ph&aacute;t h&agrave;nh d&#x1EF1;a v&agrave;o Debian, v&agrave; n&ecirc;n &#x111;&#x1B0;&#x1EE3;c d&ugrave;ng trong tr&#x1B0;&#x1EDD;ng h&#x1EE3;p n&agrave;y:</p>

<dl>

<dt id="o">o</dt>
<dd>

<p>G&oacute;i kh&ocirc;ng n&#x1EB1;m trong Debian (th&igrave; &#x111;&#x1ECB;a ch&#x1EC9;&lt;t&ecirc;n_g&oacute;i&gt;@packages.debian.org kh&ocirc;ng t&#x1ED3;n t&#x1EA1;i).</p>

</dd>
<dt id="o1">o</dt>
<dd>

<p>Nh&agrave; duy tr&igrave; &#x111;&atilde; thay &#x111;&#x1ED5;i &#x111;&aacute;ng k&#x1EC3; c&aacute;c m&#x1EAB;u debconf (ho&#x1EB7;c th&ecirc;m m&#x1EAB;u v&agrave;o g&oacute;i Debian kh&ocirc;ng c&oacute; m&#x1EAB;u), v&agrave; kh&ocirc;ng mu&#x1ED1;n l&agrave;m phi&#x1EC1;n nh&agrave; duy tr&igrave; Debian &#x111;&aacute;p &#x1EE9;ng b&aacute;o c&aacute;o l&#x1ED7;i kh&ocirc;ng th&iacute;ch h&#x1EE3;p.</p>

</dd>
</dl>

<p>&#x110;&#x1ECB;a ch&#x1EC9; m&#x1EB7;c &#x111;&#x1ECB;nh v&#x1EAB;n khuy&#x1EBF;n kh&iacute;ch &#x111;&#x1EC3; tr&aacute;nh s&#x1EED;a b&#x1EA3;n ph&aacute;t h&agrave;nh d&#x1EF1;a v&agrave;o Debian m&agrave; kh&ocirc;ng th&ocirc;ng b&aacute;o nh&agrave; duy tr&igrave; Debian.</p>

</dd>
</dl>

<h1 id="XEM-CNG">XEM C&#x168;NG</h1>

<p><a href="http://man.he.net/man1/debconf-gettextize">debconf-gettextize(1)</a>, <a href="http://man.he.net/man1/po2debconf">po2debconf(1)</a>, <a href="http://man.he.net/man1/podebconf-report-po">podebconf-report-po(1)</a>, <a href="http://man.he.net/man7/po-debconf">po-debconf(7)</a>.</p>

<h1 id="TC-GI">T&Aacute;C GI&#x1EA2;</h1>

<pre><code>  Denis Barbier &lt;barbier@linuxfr.org&gt;</code></pre>


</body>

</html>


