<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body>



<h1 id="TN">T&Ecirc;N</h1>

<p>podebconf-display-po &mdash; hi&#x1EC3;n th&#x1ECB; n&#x1ED9;i dung c&#x1EE7;a t&#x1EAD;p tin PO tr&ecirc;n giao di&#x1EC7;n debconf</p>

<h1 id="TM-TT">T&Oacute;M T&#x1EAE;T</h1>

<p><b>podebconf-display-po</b> [<b>-h</b>] [<b>-f</b> <i>GIAO_DI&#x1EC6;N</i>] <i>t&#x1EAD;p_tin.po</i></p>

<h1 id="M-T">M&Ocirc; T&#x1EA2;</h1>

<p>&#x110;&uacute;ng nh&#x1B0; m&#x1ECD;i c&ocirc;ng vi&#x1EC7;c &#x111;&#x1ECB;a ph&#x1B0;&#x1A1;ng ho&aacute;, ng&#x1B0;&#x1EDD;i d&#x1ECB;ch n&ecirc;n ki&#x1EC3;m tra b&#x1EA3;n d&#x1ECB;ch b&#x1EB1;ng c&aacute;ch ch&#x1EA1;y ch&#x1B0;&#x1A1;ng tr&igrave;nh &#x111;ang d&#x1ECB;ch. Tuy nhi&ecirc;n, &#x111;&acirc;y l&agrave; ti&#x1EBF;n tr&igrave;nh r&#x1EA5;t kh&oacute;, d&ugrave;ng c&aacute;c v&#x103;n l&#x1EC7;nh c&#x1EA5;u h&igrave;nh ph&#x1EE9;c t&#x1EA1;p, v&igrave; ch&#x1B0;a c&oacute; ph&#x1B0;&#x1A1;ng ph&aacute;p t&#x1EF1; &#x111;&#x1ED9;ng hi&#x1EC3;n th&#x1ECB; m&#x1ECD;i chu&#x1ED7;i &#x111;&atilde; d&#x1ECB;ch.</p>

<p>Ch&#x1B0;&#x1A1;ng tr&igrave;nh <b>podebconf-display-po</b> c&#x169;ng c&oacute; th&#x1EC3; &#x111;&#x1B0;&#x1EE3;c g&#x1ECD;i l&agrave; <i>B&#x1ED9; Ki&#x1EC3;m Tra Nhanh B&#x1EA3;n &#x110;&#x1ECB;a Ho&aacute;</i> cho debconf. N&oacute; ph&acirc;n t&aacute;ch t&#x1EAD;p tin PO, th&#x1EED; &#x111;o&aacute;n h&igrave;nh th&#x1EE9;c c&#x1EE7;a t&#x1EAD;p tin m&#x1EAB;u g&#x1ED1;c, v&agrave; hi&#x1EC3;n th&#x1ECB; c&aacute;c chu&#x1ED7;i tr&ecirc;n giao di&#x1EC7;n debconf.</p>

<p>Kh&ocirc;ng c&#x1EA7;n &#x111;&#x103;ng nh&#x1EAD;p d&#x1B0;&#x1EDB;i ng&#x1B0;&#x1EDD;i ch&#x1EE7; (root), v&agrave; <b>podebconf-display-po</b> kh&ocirc;ng t&#x1B0;&#x1A1;ng t&aacute;c v&#x1EDB;i b&#x1EA5;t k&#x1EF3; thi&#x1EBF;t l&#x1EAD;p to&agrave;n h&#x1EC7; th&#x1ED1;ng.</p>

<h1 id="TY-CHN">T&Ugrave;Y CH&#x1ECC;N</h1>

<dl>

<dt id="h---help"><b>-h</b>, <b>--help</b></dt>
<dd>

<p>Hi&#x1EC3;n th&#x1ECB; b&#x1EA3;n t&oacute;m t&#x1EAF;t c&aacute;ch s&#x1EED; d&#x1EE5;ng, r&#x1ED3;i tho&aacute;t.</p>

</dd>
<dt id="f---frontend-GIAO_DIN"><b>-f</b>, <b>--frontend=<i>GIAO_DI&#x1EC6;N</i></b></dt>
<dd>

<p>Ch&#x1ECD;n giao di&#x1EC7;n debconf kh&aacute;c.</p>

</dd>
</dl>

<h1 id="CN-THN">C&#x1EA8;N TH&#x1EAC;N</h1>

<ul>

<li><p>V&igrave; <b>podebconf-display-po</b> nh&#x1EDD; <code>debconf</code> &#x111;&#x1EC3; hi&#x1EC3;n th&#x1ECB; c&acirc;u h&#x1ECF;i, m&ocirc;i tr&#x1B0;&#x1EDD;ng c&#x1EE7;a b&#x1EA1;n ph&#x1EA3;i &#x111;&#x1B0;&#x1EE3;c thi&#x1EBF;t l&#x1EAD;p &#x111;&#x1EC3; hi&#x1EC3;n th&#x1ECB; c&acirc;u h&#x1ECF;i &#x111;&atilde; d&#x1ECB;ch b&#x1EB1;ng ng&ocirc;n ng&#x1EEF; c&#x1EE7;a t&#x1EAD;p tin PO. V&#x1EAD;y n&#x1EBF;u b&#x1EA1;n c&#x1EA7;n ki&#x1EC3;m tra b&#x1EA3;n d&#x1ECB;ch b&#x1EB1;ng m&#x1ED9;t ng&ocirc;n ng&#x1EEF; kh&aacute;c, ch&#x1EC9; c&#x1EA7;n s&#x1EED;a &#x111;&#x1ED5;i t&#x1EA1;m th&#x1EDD;i thi&#x1EBF;t l&#x1EAD;p , v.d.</p>

<pre><code>  $ LANGUAGE=vi podebconf-display-po vi.po</code></pre>

<p>N&#x1EBF;u t&#x1EAD;p tin PO kh&ocirc;ng chuy&#x1EC3;n &#x111;&#x1ED5;i &#x111;&#x1B0;&#x1EE3;c sang b&#x1EA3;ng m&atilde; hi&#x1EC7;n th&#x1EDD;i, c&aacute;c chu&#x1ED7;i &#x111;&#x1B0;&#x1EE3;c hi&#x1EC3;n th&#x1ECB; ch&#x1EC9; b&#x1EB1;ng ng&ocirc;n ng&#x1EEF; g&#x1ED1;c (th&#x1B0;&#x1EDD;ng l&agrave; ti&#x1EBF;ng Anh) thay cho c&aacute;c chu&#x1ED7;i d&#x1ECB;ch. &#x110;&#x1EC3; tr&aacute;nh tr&#x1B0;&#x1EDD;ng h&#x1EE3;p b&#x1EA3;ng m&atilde; kh&ocirc;ng t&#x1B0;&#x1A1;ng &#x1EE9;ng, khuy&ecirc;n b&#x1EA1;n s&#x1EED; d&#x1EE5;ng m&#x1ED9;t m&ocirc;i tr&#x1B0;&#x1EDD;ng UTF-8 (Unicode).</p>

</li>
<li><p>Tr&#x1B0;&#x1EDB;c phi&ecirc;n b&#x1EA3;n 0.8.3, <code>po-debconf</code> ch&#x1EC9; ch&egrave;n v&agrave;o t&#x1EAD;p tin PO t&ecirc;n c&#x1EE7;a tr&#x1B0;&#x1EDD;ng. Tuy nhi&ecirc;n, m&#x1ED9;t s&#x1ED1; cu&#x1ED9;c th&#x1EA3;o lu&#x1EAD;n trong h&#x1ED9;p th&#x1B0; chung &#x111;&atilde; gi&#x1EA3;i th&iacute;ch r&#x1EB1;ng &#x111;&#x1ECB;nh d&#x1EA1;ng v&#x103;n b&#x1EA3;n ph&#x1EE5; thu&#x1ED9;c v&agrave;o ki&#x1EC3;u m&#x1EAB;u, v.d. chu&#x1ED7;i v&agrave; lu&#x1EAD;n l&yacute; c&oacute; ki&#x1EC3;u kh&aacute;c nhau v&igrave; chu&#x1ED7;i l&agrave; c&acirc;u h&#x1ECF;i m&#x1EDF;, v&agrave;o &#x111;&oacute; ng&#x1B0;&#x1EDD;i d&ugrave;ng n&ecirc;n g&otilde; v&#x103;n b&#x1EA3;n, c&ograve;n lu&#x1EAD;n l&yacute; c&#x1A1; b&#x1EA3;n l&agrave; c&acirc;u h&#x1ECF;i C&oacute;/Kh&ocirc;ng, ch&#x1EC9; c&oacute; hai &#x111;&aacute;p &#x1EE9;ng c&oacute; th&#x1EC3;. T&aacute;c gi&#x1EA3; v&agrave; ng&#x1B0;&#x1EDD;i d&#x1ECB;ch n&ecirc;n suy t&iacute;nh tr&#x1B0;&#x1EDD;ng h&#x1EE3;p n&agrave;y khi t&#x1EA1;o v&agrave; d&#x1ECB;ch chu&#x1ED7;i.</p>

<p>T&#x1EAD;p tin PO &#x111;&#x1B0;&#x1EE3;c t&#x1EA1;o ra b&#x1EDF;i po-debconf &gt;= 0.8.3 c&#x169;ng ch&egrave;n v&agrave;o t&#x1EAD;p tin PO ki&#x1EC3;u c&#x1EE7;a m&#x1EAB;u. &#x110;&#x1ED1;i v&#x1EDB;i phi&ecirc;n b&#x1EA3;n c&#x169;, <b>podebconf-display-po</b> d&ugrave;ng thu&#x1EAD;t to&aacute;n &#x111;&#x1A1;n gi&#x1EA3;n &#x111;&#x1EC3; quy&#x1EBF;t &#x111;&#x1ECB;nh ki&#x1EC3;u m&#x1EAB;u, &#x111;&ocirc;i khi ch&#x1EA1;y sai.</p>

</li>
<li><p>Giao di&#x1EC7;n <code>dialog</code>, khi d&#x1EF1;a v&agrave;o <code>whiptail</code>, b&#x1EAF;t c&aacute;c k&yacute; hi&#x1EC7;u c&#x1EE7;a h&#x1EC7; th&#x1ED1;ng, th&igrave; <b>podebconf-display-po</b> kh&ocirc;ng th&#x1EC3; b&#x1ECB; <code>Ctrl-C</code> gi&aacute;n &#x111;o&#x1EA1;n khi d&ugrave;ng giao di&#x1EC7;n n&agrave;y.</p>

</li>
</ul>

<h1 id="XEM-CNG">XEM C&#x168;NG</h1>

<p><a href="http://man.he.net/man1/debconf">debconf(1)</a></p>

<h1 id="TC-GI">T&Aacute;C GI&#x1EA2;</h1>

<pre><code>  Denis Barbier &lt;barbier@linuxfr.org&gt;</code></pre>


</body>

</html>


